Revit 2026 API

# ElectricalSystemApparentLoad Property

---

The ApparentLoad value of the Electrical System.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double ApparentLoad { get; }
```
```vb
Public ReadOnly Property ApparentLoad As Double
	Get
```
```cpp
public:
property double ApparentLoad {
	double get ();
}
```
```fsharp
member ApparentLoad : float with get
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This property only available when System Type is Power! |

This property is used to retrieve the ApparentLoad value of the Electrical System.

#### Reference

ElectricalSystem Class

Autodesk.Revit.DB.Electrical Namespace